app/views/profile_informations/_education_fields.html.erb

SELECT "educations".* FROM "educations" WHERE "educations"."profile_information_id" = $1  [["profile_information_id", 3]]
---
    <%= f.label :score_type,"Score type", class: "form-label"%>
    <%= f.select :score_type, Education.score_types.keys.map { |k| [k.humanize, k] }, {}, class: 'form-select' %>