app/views/profile_informations/_form.html.erb

    <%= form.label :company_id, "Company Name" %>
    <%= form.select :company_id, options_for_select(Company.all.map { |c| [c.company_name, c.id] }) %>
---
SELECT "companies".* FROM "companies"