app/views/profile_informations/index.html.erb


            <% profile_information.educations.each do |education| %>
---
SELECT "educations".* FROM "educations" WHERE "educations"."profile_information_id" = $1 LIMIT $2  [["profile_information_id", 2], ["LIMIT", 1]]


        <% profile_information.experiences.each do |experience| %>
---
SELECT "experiences".* FROM "experiences" WHERE "experiences"."profile_information_id" = $1  [["profile_information_id", 2]]


        <% profile_information.projects.each do |project| %>
---
SELECT "projects".* FROM "projects" WHERE "projects"."profile_information_id" = $1  [["profile_information_id", 2]]

          <ul>
            <% profile_information.skills.each do |skill| %>
---
SELECT "skills".* FROM "skills" INNER JOIN "profile_information_skills" ON "skills"."id" = "profile_information_skills"."skill_id" WHERE "profile_information_skills"."profile_information_id" = $1  [["profile_information_id", 2]]