app/views/profile_informations/show.html.erb

SELECT "educations".* FROM "educations" WHERE "educations"."profile_information_id" = $1  [["profile_information_id", 2]]
---
  <legend>Education</legend>
  <% @pi.educations.each do |education| %>

SELECT "experiences".* FROM "experiences" WHERE "experiences"."profile_information_id" = $1  [["profile_information_id", 2]]
---
  <legend>Experience</legend>
  <% @pi.experiences.each do |experience| %>

SELECT "projects".* FROM "projects" WHERE "projects"."profile_information_id" = $1  [["profile_information_id", 2]]
---
  <legend>Project</legend>
  <% @pi.projects.each do |project| %>

SELECT "skills".* FROM "skills" INNER JOIN "profile_information_skills" ON "skills"."id" = "profile_information_skills"."skill_id" WHERE "profile_information_skills"."profile_information_id" = $1  [["profile_information_id", 2]]
---
<ul class="profile-information-skills">
  <% @pi.skills.each do |skill| %>