app/views/job_posts/_form.html.erb

SELECT "companies".* FROM "companies"
---
      <%= form.label :company_id, "Company Name", class: 'form-label' %>
      <%= form.select :company_id, options_for_select(Company.all.map { |c| [c.company_name, c.id] }), {}, class: 'form-select' %>