app/views/job_posts/show.html.erb

SELECT "skills".* FROM "skills" INNER JOIN "job_post_skills" ON "skills"."id" = "job_post_skills"."skill_id" WHERE "job_post_skills"."job_post_id" = $1  [["job_post_id", 1]]
---
        <ul class="job-post-skills">
          <% @jp.skills.each do |skill| %>