app/controllers/applied_jobs_controller.rb

SELECT "job_posts".* FROM "job_posts" WHERE "job_posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    if current_user.recruiter? || current_user.admin?
      @jp = JobPost.find_by(created_by: current_user.id)

      if @jp.present?
        @applied_job = AppliedJob.where(job_post_id: @jp.id)
      end
    elsif current_user.job_seeker?
      @applied_job = current_user.applied_jobs.includes(:job_post)

SELECT "job_posts".* FROM "job_posts" WHERE "job_posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "applied_jobs" WHERE "applied_jobs"."user_id" = $1 AND "applied_jobs"."job_post_id" = $2 LIMIT $3  [["user_id", 1], ["job_post_id", 1], ["LIMIT", 1]]
INSERT INTO "applied_jobs" ("status", "created_at", "updated_at", "company_id", "job_post_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["status", 0], ["created_at", "2025-04-04 10:56:50.312589"], ["updated_at", "2025-04-04 10:56:50.312589"], ["company_id", 3], ["job_post_id", 1], ["user_id", 1]]
---
  def create
    @jp = JobPost.find(params[:job_post_id])

    if AppliedJob.exists?(user_id: current_user.id, job_post_id: @jp.id)
      redirect_to @jp, alert: "You have already applied for this job."
    else
      @applied_job = AppliedJob.new(
        user_id: current_user.id, job_post_id: @jp.id, status: :applied)

      if @applied_job.save