app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies"
---
  def index
    @company = Company.all

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @company = Company.find(params[:id])

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @company = Company.find(params[:id])

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "companies" SET "location" = $1, "updated_at" = $2 WHERE "companies"."id" = $3  [["location", ""], ["updated_at", "2025-04-02 06:43:48.320441"], ["id", 2]]
---
  def update
    @company = Company.find(params[:id])
    if @company.update(company_params)