app/controllers/job_posts_controller.rb

SELECT "job_posts".* FROM "job_posts"
SELECT 1 AS one FROM "applied_jobs" WHERE "applied_jobs"."user_id" = $1 AND "applied_jobs"."job_post_id" = $2 LIMIT $3  [["user_id", 1], ["job_post_id", 1], ["LIMIT", 1]]
---
  def index
    @jp = JobPost.all
    @applied_status = {}

    @jp.each do |job_post|
      # Check if the current user has already applied for this job
      @applied_status[job_post.id] = AppliedJob.exists?(user_id: current_user.id, job_post_id: job_post.id)

SELECT "skills".* FROM "skills"
---
  def new
    @jp = JobPost.new
    @skills = Skill.all

SELECT "job_posts".* FROM "job_posts" WHERE "job_posts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "applied_jobs".* FROM "applied_jobs" WHERE "applied_jobs"."user_id" = $1 AND "applied_jobs"."job_post_id" = $2 LIMIT $3  [["user_id", 1], ["job_post_id", 1], ["LIMIT", 1]]
---
  def show
    @jp = JobPost.find_by(id: params[:id])
    @applied_job = AppliedJob.find_by(user_id: current_user.id, job_post_id: @jp.id) if current_user

SELECT "skills".* FROM "skills"
SELECT 1 AS one FROM "job_post_skills" WHERE "job_post_skills"."job_post_id" = $1 AND "job_post_skills"."skill_id" = $2 LIMIT $3  [["job_post_id", 7], ["skill_id", 2], ["LIMIT", 1]]
INSERT INTO "job_post_skills" ("job_post_id", "skill_id", "level", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["job_post_id", 7], ["skill_id", 2], ["level", nil], ["created_at", "2025-04-04 08:26:10.597627"], ["updated_at", "2025-04-04 08:26:10.597627"]]
INSERT INTO "job_posts" ("title", "job_type", "description", "created_by", "created_at", "updated_at", "company_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "abc"], ["job_type", "asx"], ["description", "asx"], ["created_by", nil], ["created_at", "2025-04-04 08:26:10.566311"], ["updated_at", "2025-04-04 08:26:10.566311"], ["company_id", 1]]
SELECT 1 AS one FROM "job_post_skills" WHERE "job_post_skills"."job_post_id" = $1 AND "job_post_skills"."skill_id" = $2 LIMIT $3  [["job_post_id", 6], ["skill_id", 2], ["LIMIT", 1]]
INSERT INTO "job_posts" ("title", "type", "description", "created_by", "created_at", "updated_at", "company_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "abc"], ["type", ""], ["description", ""], ["created_by", nil], ["created_at", "2025-04-04 06:51:02.683768"], ["updated_at", "2025-04-04 06:51:02.683768"], ["company_id", 1]]
INSERT INTO "job_post_skills" ("job_post_id", "skill_id", "level", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["job_post_id", 6], ["skill_id", 2], ["level", nil], ["created_at", "2025-04-04 08:21:53.864103"], ["updated_at", "2025-04-04 08:21:53.864103"]]
---
  def create
    @jp = JobPost.new(job_post_params)

    # Adding random skills to the job post (if not already added)
    random_skills = Skill.all.sample(rand(1..8))
    random_skills.each do |skill|
      unless JobPostSkill.exists?(job_post_id: @jp.id, skill_id: skill.id)
        JobPostSkill.create(job_post_id: @jp.id, skill_id: skill.id)
      end
    end
    if AppliedJob.exists?(user_id: current_user.id, job_post_id: @jp.id)
      redirect_to @jp, alert: 'You have already applied for this job.'
    else
      @applied_job = AppliedJob.new(user_id: current_user.id, job_post_id: @jp.id, status: :applied)

      if @applied_job.save
        redirect_to @jp, notice: 'You have successfully applied for the job.'
      else
        redirect_to @jp, alert: 'There was an error with your application.'
      end
    end
    if @jp.save

SELECT "job_posts".* FROM "job_posts" WHERE "job_posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "skills".* FROM "skills"
---
  def edit
    @jp = JobPost.find(params[:id])
    @skills = Skill.all

SELECT "job_posts".* FROM "job_posts" WHERE "job_posts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "job_posts" SET "type" = $1, "description" = $2, "updated_at" = $3 WHERE "job_posts"."id" = $4  [["type", "amd"], ["description", "jhjn"], ["updated_at", "2025-04-04 07:20:25.268208"], ["id", 6]]
---
  def update
    @jp = JobPost.find(params[:id])
    if @jp.update(job_post_params)