app/controllers/job_posts_controller.rb

SELECT "job_posts".* FROM "job_posts" WHERE "job_posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "skills".* FROM "skills" INNER JOIN "job_post_skills" ON "skills"."id" = "job_post_skills"."skill_id" WHERE "job_post_skills"."job_post_id" = $1  [["job_post_id", 6]]
---
    def edit
      @jp = JobPost.find(params[:id])
      @jp.skill_assignments.build if @jp.skill_assignments.empty?

UPDATE "job_posts" SET "type" = $1, "description" = $2, "updated_at" = $3 WHERE "job_posts"."id" = $4  [["type", "amd"], ["description", "jhjn"], ["updated_at", "2025-04-04 07:20:25.268208"], ["id", 6]]
---
    def update
      @jp = JobPost.find(params[:id])
      @skills = @jp.skills.pluck(:name)

      if @jp.update(job_post_params)