app/controllers/profile_informations_controller.rb

    def index
      @pi = ProfileInformation.all
      @profile_informations = ProfileInformation.includes(:experiences).all
      @pi = ProfileInformation.includes(:skills).all
---
SELECT "profile_informations".* FROM "profile_informations"
SELECT "experiences".* FROM "experiences" WHERE "experiences"."profile_information_id" = $1  [["profile_information_id", 1]]
SELECT "skills".* FROM "skills" INNER JOIN "profile_information_skills" ON "skills"."id" = "profile_information_skills"."skill_id" WHERE "profile_information_skills"."profile_information_id" = $1  [["profile_information_id", 2]]

    def show
      @pi = ProfileInformation.find(params[:id])
---
SELECT "profile_informations".* FROM "profile_informations" WHERE "profile_informations"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def new
      @pi = current_user.build_profile_information
      @pi.educations.build
      @pi.experiences.build
      @pi.projects.build
      @skills = Skill.all
---
SELECT "skills".* FROM "skills"

    def create
      @pi = current_user.build_profile_information(profile_information_params)

      if @pi.save

        random_skills = Skill.all.sample(rand(1..8))
        random_skills.each do |skill|
          unless ProfileInformationSkill.exists?(profile_information_id: @pi.id, skill_id: skill.id)
            ProfileInformationSkill.create(profile_information_id: @pi.id, skill_id: skill.id)
---
UPDATE "profile_informations" SET "updated_at" = $1 WHERE "profile_informations"."id" = $2  [["updated_at", "2025-03-17 10:08:53.808540"], ["id", 9]]
INSERT INTO "profile_informations" ("firstname", "lastname", "phone_number", "profile_image", "created_at", "updated_at", "company_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "skills".* FROM "skills"
SELECT "profile_information_skills".* FROM "profile_information_skills" WHERE "profile_information_skills"."profile_information_id" = $1  [["profile_information_id", 6]]
SELECT "profile_informations".* FROM "profile_informations" WHERE "profile_informations"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "profile_information_skills" WHERE "profile_information_skills"."profile_information_id" = $1 AND "profile_information_skills"."skill_id" = $2 LIMIT $3  [["profile_information_id", 6], ["skill_id", 2], ["LIMIT", 1]]
INSERT INTO "profile_information_skills" ("skill_id", "profile_information_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["skill_id", 2], ["profile_information_id", 6], ["created_at", "2025-04-04 09:47:45.949872"], ["updated_at", "2025-04-04 09:47:45.949872"]]

    def edit
      @pi = ProfileInformation.find(params[:id])
      @skills = Skill.all
---
SELECT "profile_informations".* FROM "profile_informations" WHERE "profile_informations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "skills".* FROM "skills"

    def update
      @pi = ProfileInformation.find(params[:id])
      if @pi.update(profile_information_params)
---
SELECT "profile_informations".* FROM "profile_informations" WHERE "profile_informations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "profile_informations" SET "phone_number" = $1, "updated_at" = $2, "company_id" = $3 WHERE "profile_informations"."id" = $4  [["phone_number", ""], ["updated_at", "2025-04-04 08:49:30.923473"], ["company_id", 1], ["id", 3]]