app/controllers/profile_informations_controller.rb

SELECT "skills".* FROM "skills" INNER JOIN "profile_information_skills" ON "skills"."id" = "profile_information_skills"."skill_id" WHERE "profile_information_skills"."profile_information_id" = $1  [["profile_information_id", 2]]
---
  def edit
    @pi = ProfileInformation.find(params[:id])
    @pi.skill_assignments.build if @pi.skill_assignments.empty?